{
  "backend/main.mo": "Motoko canister implementing Internet Identity–based access control, user profiles, and per-user game progress for three levels, with authorization checks on all public methods.",
  "feature_evidence.json": "Machine-readable feature evidence report mapping implemented features to frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend source files, hooks, components, styles, and documentation for quick reference.",
  "frontend/index.css": "Global Tailwind CSS base styles and OKLCH color tokens defining the Chinese New Year red/gold theme with light and dark mode support.",
  "frontend/index.html": "HTML entry point that mounts the React application and loads the Vite-powered TypeScript bundle.",
  "frontend/README.md": "Comprehensive developer documentation describing the game concept, frontend/backend architecture, gameplay features, data flow, and local development setup.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup, and screen-based navigation across all game pages.",
  "frontend/src/components/auth/LoginLogoutButton.tsx": "Reusable button component handling Internet Identity sign-in/sign-out and clearing React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog forcing first-time authenticated users to enter and save a display name before accessing the game.",
  "frontend/src/components/game/FoundFeedbackOverlay.tsx": "Temporary animated visual overlay shown at click coordinates when a hidden object is successfully found.",
  "frontend/src/components/layout/CnyLayout.tsx": "Defines a themed page layout with CNY styling, including a header, main content slot, and footer with credits and icons.",
  "frontend/src/game/HiddenObjectScene.tsx": "Implements the core hidden-object gameplay scene, tracking found objects, progress, and click feedback while rendering interactive targets over a background image.",
  "frontend/src/game/levels.ts": "Exports static level definitions describing titles, targets, background images, and object placements for each hidden-object level.",
  "frontend/src/game/types.ts": "Declares TypeScript interfaces for level definitions and target placement metadata used by the game.",
  "frontend/src/game/useSoundEffects.ts": "Provides a React hook to manage mute state and play a simple Web Audio sound effect when an object is found.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, handling authentication, access control initialization, and query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Defines React Query hooks to fetch and save the current caller’s user profile via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Internet Identity, managing login state, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for reading and mutating user game progress, such as marking levels completed or resetting progress.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles, theme variables (including CNY colors), dark mode overrides, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring up React Query and Internet Identity providers and rendering the root App component.",
  "frontend/src/pages/AuthPage.tsx": "Authentication landing page that shows game intro, features, and a login/logout button, greeting authenticated users by name using Internet Identity and profile hooks.",
  "frontend/src/pages/GameCompletePage.tsx": "End-of-game screen displayed after all levels are completed, showing achievements and allowing navigation back to level select or resetting user progress.",
  "frontend/src/pages/GameplayPage.tsx": "Main gameplay page that renders a hidden object scene for a selected level, tracks found objects, plays sound effects, and marks levels complete when targets are found.",
  "frontend/src/pages/LevelCompletePage.tsx": "Intermediate completion screen shown after finishing a level, displaying results and offering navigation to the next level or back to level selection.",
  "frontend/src/pages/LevelSelectPage.tsx": "Level selection dashboard that displays available levels, completion status from user progress, user greeting, and routes to gameplay or game completion when all levels are done.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters, supporting both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom Chinese New Year colors, animations, container settings, and enabled plugins.",
  "project_state.json": "Defines the overall project state and scope for a full-stack 2D Chinese New Year themed hidden-object game, including schema/version metadata and a high-level project summary. Lists implemented features such as Internet Identity authentication, frontend screens, gameplay logic for three levels, progress persistence, React Query caching, and data-driven level configuration."
}